CaseLabGreenatom/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗаказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

CaseLabGreenatom/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

CaseLabGreenatom/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаБезНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.РеквизитыОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Блюдо</name>
  </enumValues>
  <enumValues>
    <name>Продукт</name>
  </enumValues>
  <enumValues>
    <name>РасходныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Enums/СтатусЗаказаПоставщика/СтатусЗаказаПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказаПоставщика</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НаправленПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>ЗавтраПоставка</name>
  </enumValues>
  <enumValues>
    <name>СегодняПоставка</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Documents/ПоступлениеТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "ПТУ";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ТекущийСотрудникСервер.СотрудникТекущегоПользователя();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументЗаказ = ДанныеЗаполнения;
		
		Если ЗначениеЗаполнено(ДокументЗаказ.ДокументПоступления) Тогда
			
			ВызватьИсключение СтрШаблон("Для %1 уже создан %2", ДокументЗаказ, ДокументЗаказ.ДокументПоступления); //Откажемся от создания документа, если по нему уже было создано ПТУ.	
			
		КонецЕсли;
		
		Для Каждого ТекСтрокаПозиции Из ДанныеЗаполнения.Позиции Цикл
			
			НоваяСтрока = Позиции.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПозиции.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаПозиции.Наименование;
			НоваяСтрока.СтавкаНДС = ТекСтрокаПозиции.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаПозиции.Сумма;
			НоваяСтрока.СуммаНДС = ТекСтрокаПозиции.СуммаНДС;
			НоваяСтрока.Цена = ТекСтрокаПозиции.Цена;
			НоваяСтрока.СуммаСНДС = ТекСтрокаПозиции.СуммаСНДС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Позиции.Итог("СуммаСНДС");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
	Движения.ОстаткиТоваров.Очистить();
	Движения.Закупки.Очистить();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Закупки.Записывать = Истина;
	
	ТипИнгредиент = Перечисления.ТипНоменклатуры.Продукт;
	ТипРасходныйМатериал = Перечисления.ТипНоменклатуры.РасходныйМатериал;
	
	СтатусИсполнен = Перечисления.СтатусЗаказаПоставщика.Исполнен;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровПозиции.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровПозиции.Номенклатура.Тип КАК НоменклатураТипНоменклатуры,
		|	СУММА(ПоступлениеТоваровПозиции.Количество) КАК Количество,
		|	ПоступлениеТоваров.Контрагент КАК Контрагент,
		|	ПоступлениеТоваров.Ответственный КАК Ответственный,
		|	ПоступлениеТоваров.Склад КАК Склад,
		|	ПоступлениеТоваровПозиции.СуммаСНДС КАК Сумма,
		|	ПоступлениеТоваровПозиции.Цена КАК Цена,
		|	ПоступлениеТоваровПозиции.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваров.ДокументЗаказ КАК ДокументЗаказ,
		|	ПоступлениеТоваров.ДокументЗаказ.ДокументПоступления КАК ДокументЗаказДокументПоступления
		|ИЗ
		|	Документ.ПоступлениеТоваров.Позиции КАК ПоступлениеТоваровПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|		ПО ПоступлениеТоваровПозиции.Ссылка = ПоступлениеТоваров.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровПозиции.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровПозиции.Номенклатура,
		|	ПоступлениеТоваровПозиции.Номенклатура.Тип,
		|	ПоступлениеТоваров.Контрагент,
		|	ПоступлениеТоваров.Ответственный,
		|	ПоступлениеТоваров.Склад,
		|	ПоступлениеТоваровПозиции.СуммаСНДС,
		|	ПоступлениеТоваровПозиции.Цена,
		|	ПоступлениеТоваровПозиции.СтавкаНДС,
		|	ПоступлениеТоваров.ДокументЗаказ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗаказПоставщику", ДокументЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
		Если ВыборкаДетальныеЗаписи.НоменклатураТипНоменклатуры = ТипИнгредиент Или ВыборкаДетальныеЗаписи.НоменклатураТипНоменклатуры = ТипРасходныйМатериал Тогда
			
			Если ВыборкаДетальныеЗаписи.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				
				СтавкаНДС = 0;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				
				СтавкаНДС = 10;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				
				СтавкаНДС = 20;
				
			КонецЕсли;
             			
			//Запись движения по Регистру накопления Остатки Товаров
			
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
						
			//Запись движения по Регистру накопления Закупки
			
			Движение = Движения.Закупки.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Движение.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
			
			//Запись по регистру Цены
			
			Движение = Движения.Цены.Добавить();
			Движение.Активность = Истина;
			Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.ЦенаБезНДС = ВыборкаДетальныеЗаписи.Цена;
			Движение.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			Движение.ЦенаСНДС = ВыборкаДетальныеЗаписи.Цена + (ВыборкаДетальныеЗаписи.Цена * СтавкаНДС / 100);
			Движение.СуммаНДС = ВыборкаДетальныеЗаписи.Цена * СтавкаНДС / 100;
			
			//Запись статуса в документ Заказ поставщику
			
			ЗаказПоставщику = ВыборкаДетальныеЗаписи.ДокументЗаказ.ПолучитьОбъект();
			ЗаказПоставщику.Статус = Перечисления.СтатусЗаказаПоставщика.Исполнен;
			ЗаказПоставщику.ДокументПоступления = Ссылка;
			ЗаказПоставщику.Записать();
			
			Иначе 
			
			Продолжить;
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
